import { Typescratcher as Ts } from "../../../src";
import { Sprite } from "../../../src";
const stageBounds = Ts.StageBounds;
const stageWidth = stageBounds.w;
const stageHeight = stageBounds.h;

export const Map01: number[][] = [
    [1,1,1,1,1, 1,1,1,1,1, 1,1,1,1,1, 1,1,1,1,1, 1],
    [1,9,0,0,0, 0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0, 1],
    [1,0,1,1,1, 0,1,1,1,1, 0,1,0,1,1, 1,1,1,0,0, 1],
    [1,0,0,0,0, 0,0,0,1,1, 0,1,0,0,1, 1,1,1,0,0, 1],
    [1,0,1,1,1, 0,1,0,0,1, 0,1,0,0,0, 0,0,0,0,0, 1],

    [1,0,1,0,0, 0,1,0,1,1, 1,1,0,0,1, 0,0,1,1,0, 1],
    [1,0,1,0,1, 1,1,0,1,0, 0,0,0,0,1, 0,1,2,1,0, 1],
    [1,0,0,0,1, 0,1,0,0,1, 1,1,0,1,1, 0,1,0,1,0, 1],
    [1,0,1,0,1, 0,1,2,1,0, 1,1,0,0,0, 0,1,0,1,0, 1],
    [1,0,1,0,1, 0,1,1,0,0, 1,1,0,0,1, 1,1,0,1,0, 1],

    [1,0,1,0,0, 0,1,0,0,0, 0,0,0,0,0, 0,1,0,0,0, 1],
    [1,0,0,0,0, 0,1,1,1,1, 1,0,0,0,0, 0,1,1,1,1, 1],
    [1,0,0,0,0, 0,0,0,0,0, 0,0,0,0,1, 1,0,0,0,0, 1],
    [1,0,1,1,1, 1,1,0,0,0, 0,0,0,0,1, 1,0,0,0,0, 1],
    [1,0,0,0,0, 0,0,0,1,1, 1,1,1,0,1, 1,0,0,0,0, 1],

    [1,0,1,0,0, 1,0,1,1,1, 1,0,0,0,0, 0,0,0,0,0, 1],
    [1,0,1,0,0, 0,0,0,0,0, 0,0,1,1,0, 0,0,0,0,0, 1],
    [1,0,1,1,1, 0,1,1,1,1, 0,0,1,1,0, 0,1,1,0,0, 1],
    [1,0,0,1,0, 0,0,1,0,0, 1,0,1,1,0, 0,0,0,0,0, 1],
    [1,0,0,0,0, 1,0,0,0,0, 0,0,0,0,0, 1,1,0,0,0, 1],

    [1,1,1,1,1, 1,1,1,1,1, 1,1,1,1,1, 1,1,1,1,1 ,1],
];

export const WallWidth = stageWidth/Map01[0].length;
export const WallHeight = stageHeight/Map01.length;

export interface IWall extends Sprite {

    type: number;

}

/**
 *  Ts.Spriteを継承する Wallクラス
 */
export class Wall extends Ts.Sprite implements IWall{

    public type: number = -1; // 初期値は -1

    protected makeClone(name : string) : Sprite {
        const clone = new Wall(name);
        clone.type = this.type;
        return clone;
    }
}